# Curso: (Mini) Introdução ao Python para processamento e análise de dados 
Maurício Garcia, março 2023

In [1]:
import pandas as pd

In [2]:
df = pd.read_excel('_data/Tab1.xlsx')

In [3]:
df.head(5)

                         Nome           RG          CPF Sexo  Nascimento
0            Clarice Gonzales  88829099450  49492282913    F  2008-02-25
1            Maria Isis Ramos  43437187759  83067956448    F  1999-02-27
2               Daniela Palma  58946054283  32723668271    M  1982-03-03
3  Maria da Conceição Antunes  23000712291  39961145321    F  1973-03-05
4          Valentina Williams  68948263392  39936634316    F  1956-03-09

In [4]:
# Converte string em formato DATETIME
df['Nascimento'] = pd.to_datetime(df['Nascimento'])

In [5]:
# Calcula a idade em dias
df['Idade_dias'] = (pd.to_datetime('today') - df['Nascimento']).dt.days

In [6]:
# Converte a idade em dias para idade em anos, em números inteiros ('int')
df['Idade_anos'] = round(df['Idade_dias']/365,0).astype('int')

In [7]:
# Calcula a data em que completa 18 anos (18 anos = 6570 dias)
df['Dezoito'] = df['Nascimento'] + pd.to_timedelta('6570 days')

In [8]:
df.head(5)

,Nome,RG,CPF,Sexo,Nascimento,Idade_dias,Idade_anos,Dezoito
0,Clarice Gonzales,88829099450,49492282913,F,2008-02-25,5488,15,2026-02-20
1,Maria Isis Ramos,43437187759,83067956448,F,1999-02-27,8773,24,2017-02-22
2,Daniela Palma,58946054283,32723668271,M,1982-03-03,14978,41,2000-02-27
3,Maria da Conceição Antunes,23000712291,39961145321,F,1973-03-05,18263,50,1991-03-01
4,Valentina Williams,68948263392,39936634316,F,1956-03-09,24468,67,1974-03-05